#### FamilyInstancePlacingArgs Members

---

|  |
| --- |
| FamilyInstancePlacingArgs Class   Methods   Properties   See Also |

The  FamilyInstancePlacingArgs  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  FamilyInstancePlacingArgs |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | ActiveView | The active view |
| Public property | IsBanned | Indicates if the cursor is banned or not. |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Public property | StatusMessage | The message to be shown on the status bar |
| Public property | TooltipMessage | The message to be shown via tooltip |

# See Also

FamilyInstancePlacingArgs Class

Autodesk.Revit.UI Namespace